<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class MAreasTableSeeder extends Seeder
{
    /**
     * Run the database seeds.<br>
     * エリアマスタ
     *
     * @return void
     */
    public function run()
    {
        // テスト環境用マスタデータ（現行システムから抽出）
        $names = ['鎌倉市稲村ヶ崎', '鎌倉市岡本', '鎌倉市梶原', '鎌倉市鎌倉山', '鎌倉市関谷', '鎌倉市岩瀬', '鎌倉市極楽寺', '鎌倉市玉縄', '鎌倉市御成町', '鎌倉市高野', '鎌倉市腰越', '鎌倉市今泉', '鎌倉市今泉台', '鎌倉市佐助', '鎌倉市材木座', '鎌倉市坂ノ下', '鎌倉市笹目町', '鎌倉市山ノ内', '鎌倉市山崎', '鎌倉市寺分', '鎌倉市七里ヶ浜', '鎌倉市七里ヶ浜東', '鎌倉市手広', '鎌倉市十二所', '鎌倉市小袋谷', '鎌倉市小町', '鎌倉市上町屋', '鎌倉市城廻', '鎌倉市常', '鎌倉市常盤', '鎌倉市浄明寺', '鎌倉市植木', '鎌倉市西鎌倉', '鎌倉市西御門', '鎌倉市雪ノ下', '鎌倉市扇ヶ谷', '鎌倉市台', '鎌倉市大船', '鎌倉市大町', '鎌倉市長谷', '鎌倉市津', '鎌倉市津西', '鎌倉市笛田', '鎌倉市二階堂', '鎌倉市由比ヶ浜', '横浜市鶴見区', '横浜市神奈川区', '横浜市西区', '横浜市中区', '横浜市南区', '横浜市保土ヶ谷区', '横浜市磯子区', '横浜市金沢区', '横浜市港北区', '横浜市戸塚区', '横浜市港南区', '横浜市旭区', '横浜市緑区', '横浜市瀬谷区', '横浜市栄区', '横浜市泉区', '横浜市青葉区', '横浜市都筑区', '川崎市川崎区', '川崎市幸区', '川崎市中原区', '川崎市高津区', '川崎市多摩区', '川崎市宮前区', '川崎市麻生区', '相模原市緑区', '相模原市中央区', '相模原市南区', '横須賀市', '平塚市', '藤沢市', '小田原市', '茅ヶ崎市', '逗子市', '三浦市', '大和市', '三浦郡葉山町', '中郡大磯町', '中郡二宮町', '東京都', '千葉県', '埼玉県'];
        for($i = 0; $i <= count($names) - 1; $i++) {
            DB::table('m_areas')->insert([
                'store_name' => $names[$i],
                'name' => $names[$i],
                'is_valid' => 1, // 0:無効 1:有効
            ]);
        }
    }
}
